---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsPathType.DistanceToCutMark
source: html/5c6dfd11-3bb4-8d71-0b82-9147ca6d52a3.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathType.DistanceToCutMark Property

The distance from the stairs path arrow to cut mark.

## Syntax (C#)
```csharp
public double DistanceToCutMark { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for distanceToCutMark must be between 0 and 30000 feet.